<?
/////////////////////////////////////////////////////////////////////
//
// Создатель CMS/Framework SolarWind: Ларионов Андрей Николаевич
// По поводу приобретения платной версии системы обращаться:
// Телефон для связи: 8-913-134-09-42
// Email: IntegralAL@mail.ru
// Класс работы с базой данных CMS SolarWind
// Разработчик: Ларионов Андрей.
// Дата новой разработки: От Январь 2026 года.
//
// Работа выполнена исключительно на энтузиазме разработчика Ларионова Андрея без должного финансирования
// и финансовой подоплеки. Потому все претензии оставляйте у себя, платная поддержка подразумевает значительно более
// высокий уровень обеспечения и кодирования
//
// php от 5.2 и даже до 8.1, не содержит синтаксиса 8.2, 8.3, 8.4
//////////////////////////////////////////////////////////////
/// Таблица clicker
/// ------------------------------------
/// | id | increment                  | первичный ключ - инкремент
/// ------------------------------------
/// | ipaddress | string (255)        | ip-адрес
/// -----------------------------------
/// | macaddress | string (255)       | мак-адрес
/// -----------------------------------
/// | page_look | text                | адрес страницы просмотренной пользователем
/// -----------------------------------
/// | time_look | datetime            | время и дата просмотра страницы
/// ___________________________________
///
////////////////////////////////////////////////////////////////

namespace App\Models;

Class Class_IP
{
    private $BD_Obj;
    private $Conf_Obj;

    function __construct()
    {
        $this->BD_Obj = new Class_BD;
        $this->Conf_Obj = new Class_Config;
    }

    public function TestClass()
    {
        return 'Ответ от класса Class_IP';
    }

    ///////////////////////////////////////////////////////
    //   Функция get_ip из сети функция (внешняя)
    //   Параметры: -
    //////////////////////////////////////////////////////
    public function get_ip()
    {
        if (!empty($_SERVER['HTTP_CLIENT_IP'])) {
            $ip = $_SERVER['HTTP_CLIENT_IP'];
        }
        elseif (!empty($_SERVER['HTTP_X_FORWARDED_FOR'])) {
            $ip=$_SERVER['HTTP_X_FORWARDED_FOR'];
        }
        else {
            $ip=$_SERVER['REMOTE_ADDR'];
        }
        return $ip;
    }

    /* Функция возврата url - getUrl
    *  параметр $PHP_SELF - булевое значение, по умолчанию false
    */
    public function getUrl($PHP_SELF = false) {
        $url  = @( $_SERVER["HTTPS"] != 'on' ) ? 'http://'.$_SERVER["SERVER_NAME"] :  'https://'.$_SERVER["SERVER_NAME"];
        $url .= ( $_SERVER["SERVER_PORT"] != 80 ) ? ":".$_SERVER["SERVER_PORT"] : "";
        if ($PHP_SELF)
            $url .= $_SERVER["PHP_SELF"];
        else
            $url .= $_SERVER["REQUEST_URI"];
        return $url;
    }


}
?>